loadtest/results/20260922-183711/4-step-500rps.txt
Running 30s test @ https://cache-api-alb-1834554219.us-east-1.elb.amazonaws.com
  4 threads and 200 connections
  Thread calibration: mean lat.: 101.741ms, rate sampling interval: 209ms
  Thread calibration: mean lat.: 108.720ms, rate sampling interval: 239ms
  Thread calibration: mean lat.: 111.552ms, rate sampling interval: 267ms
  Thread calibration: mean lat.: 112.053ms, rate sampling interval: 261ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    96.94ms    7.00ms 358.91ms   84.33%
    Req/Sec   125.56     81.83   210.00     66.97%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   95.94ms
 75.000%   99.65ms
 90.000%  103.87ms
 99.000%  114.43ms
 99.900%  156.41ms
 99.990%  322.30ms
 99.999%  359.17ms
100.000%  359.17ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      83.199     0.000000            1         1.00
      90.943     0.100000         1015         1.11
      92.543     0.200000         2012         1.25
      93.759     0.300000         3035         1.43
      94.847     0.400000         4012         1.67
      95.935     0.500000         4986         2.00
      96.575     0.550000         5538         2.22
      97.215     0.600000         5995         2.50
      97.919     0.650000         6480         2.86
      98.687     0.700000         6990         3.33
      99.647     0.750000         7501         4.00
     100.223     0.775000         7748         4.44
     100.799     0.800000         7988         5.00
     101.439     0.825000         8246         5.71
     102.079     0.850000         8478         6.67
     102.911     0.875000         8734         8.00
     103.359     0.887500         8853         8.89
     103.871     0.900000         8979        10.00
     104.383     0.912500         9101        11.43
     104.959     0.925000         9233        13.33
     105.599     0.937500         9354        16.00
     105.983     0.943750         9417        17.78
     106.303     0.950000         9472        20.00
     106.815     0.956250         9540        22.86
     107.391     0.962500         9596        26.67
     108.095     0.968750         9659        32.00
     108.479     0.971875         9696        35.56
     108.799     0.975000         9720        40.00
     109.375     0.978125         9751        45.71
     110.335     0.981250         9783        53.33
     111.423     0.984375         9816        64.00
     112.127     0.985938         9829        71.11
     112.895     0.987500         9848        80.00
     113.599     0.989062         9861        91.43
     114.879     0.990625         9876       106.67
     116.287     0.992188         9893       128.00
     117.375     0.992969         9900       142.22
     119.295     0.993750         9907       160.00
     120.703     0.994531         9915       182.86
     123.391     0.995313         9923       213.33
     129.087     0.996094         9931       256.00
     129.919     0.996484         9934       284.44
     131.583     0.996875         9938       320.00
     138.367     0.997266         9942       365.71
     142.079     0.997656         9946       426.67
     147.455     0.998047         9950       512.00
     148.991     0.998242         9952       568.89
     151.423     0.998437         9954       640.00
     153.983     0.998633         9956       731.43
     155.519     0.998828         9958       853.33
     156.543     0.999023         9960      1024.00
     157.055     0.999121         9961      1137.78
     158.207     0.999219         9962      1280.00
     160.255     0.999316         9963      1462.86
     162.047     0.999414         9964      1706.67
     172.799     0.999512         9965      2048.00
     172.799     0.999561         9965      2275.56
     179.583     0.999609         9966      2560.00
     179.583     0.999658         9966      2925.71
     197.503     0.999707         9967      3413.33
     197.503     0.999756         9967      4096.00
     197.503     0.999780         9967      4551.11
     322.303     0.999805         9968      5120.00
     322.303     0.999829         9968      5851.43
     322.303     0.999854         9968      6826.67
     322.303     0.999878         9968      8192.00
     322.303     0.999890         9968      9102.22
     359.167     0.999902         9969     10240.00
     359.167     1.000000         9969          inf
#[Mean    =       96.942, StdDeviation   =        7.000]
#[Max     =      358.912, Total count    =         9969]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  14701 requests in 30.26s, 5.10MB read
  Non-2xx or 3xx responses: 2932
Requests/sec:    485.77
Transfer/sec:    172.73KB
------------------------------
X-Cache  HIT=11159  MISS=610  BYPASS=0  writes=0  http_errors=2932
Cache hit ratio: 94.82%
Socket errors: connect=0 read=0 write=0 timeout=0
p50       95.94 ms
p90      103.87 ms
p99      114.43 ms
p99.9    156.41 ms