loadtest/results/20260922-183711/4-step-750rps.txt
Running 30s test @ https://cache-api-alb-1834554219.us-east-1.elb.amazonaws.com
  4 threads and 200 connections
  Thread calibration: mean lat.: 133.824ms, rate sampling interval: 497ms
  Thread calibration: mean lat.: 134.346ms, rate sampling interval: 499ms
  Thread calibration: mean lat.: 142.108ms, rate sampling interval: 572ms
  Thread calibration: mean lat.: 143.655ms, rate sampling interval: 627ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    95.63ms   23.87ms   1.54s    98.77%
    Req/Sec   187.28     21.63   262.00     76.92%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   94.14ms
 75.000%   97.02ms
 90.000%  100.73ms
 99.000%  130.30ms
 99.900%  189.18ms
 99.990%    1.37s 
 99.999%    1.54s 
100.000%    1.54s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      80.639     0.000000            1         1.00
      89.279     0.100000         1505         1.11
      90.879     0.200000         2981         1.25
      92.095     0.300000         4472         1.43
      93.119     0.400000         5976         1.67
      94.143     0.500000         7488         2.00
      94.655     0.550000         8210         2.22
      95.103     0.600000         8892         2.50
      95.679     0.650000         9662         2.86
      96.255     0.700000        10371         3.33
      97.023     0.750000        11147         4.00
      97.407     0.775000        11490         4.44
      97.855     0.800000        11859         5.00
      98.431     0.825000        12257         5.71
      99.007     0.850000        12597         6.67
      99.775     0.875000        12975         8.00
     100.223     0.887500        13158         8.89
     100.735     0.900000        13345        10.00
     101.247     0.912500        13511        11.43
     101.887     0.925000        13696        13.33
     102.655     0.937500        13896        16.00
     103.039     0.943750        13981        17.78
     103.487     0.950000        14066        20.00
     104.127     0.956250        14162        22.86
     104.831     0.962500        14252        26.67
     105.919     0.968750        14343        32.00
     106.559     0.971875        14389        35.56
     107.327     0.975000        14435        40.00
     108.415     0.978125        14482        45.71
     110.143     0.981250        14528        53.33
     113.087     0.984375        14574        64.00
     115.391     0.985938        14597        71.11
     118.847     0.987500        14620        80.00
     124.799     0.989062        14644        91.43
     134.527     0.990625        14667       106.67
     143.103     0.992188        14690       128.00
     145.023     0.992969        14703       142.22
     148.479     0.993750        14713       160.00
     149.631     0.994531        14725       182.86
     151.167     0.995313        14736       213.33
     153.599     0.996094        14748       256.00
     154.367     0.996484        14753       284.44
     155.391     0.996875        14760       320.00
     156.927     0.997266        14765       365.71
     160.127     0.997656        14771       426.67
     162.687     0.998047        14777       512.00
     163.455     0.998242        14779       568.89
     166.911     0.998437        14782       640.00
     169.087     0.998633        14785       731.43
     177.791     0.998828        14788       853.33
     201.599     0.999023        14791      1024.00
     202.623     0.999121        14792      1137.78
     333.567     0.999219        14794      1280.00
     348.159     0.999316        14795      1462.86
     504.319     0.999414        14797      1706.67
     512.255     0.999512        14798      2048.00
     678.399     0.999561        14799      2275.56
     692.735     0.999609        14800      2560.00
     692.735     0.999658        14800      2925.71
     854.527     0.999707        14801      3413.33
    1027.583     0.999756        14802      4096.00
    1027.583     0.999780        14802      4551.11
    1197.055     0.999805        14803      5120.00
    1197.055     0.999829        14803      5851.43
    1197.055     0.999854        14803      6826.67
    1367.039     0.999878        14804      8192.00
    1367.039     0.999890        14804      9102.22
    1367.039     0.999902        14804     10240.00
    1367.039     0.999915        14804     11702.86
    1367.039     0.999927        14804     13653.33
    1543.167     0.999939        14805     16384.00
    1543.167     1.000000        14805          inf
#[Mean    =       95.629, StdDeviation   =       23.870]
#[Max     =     1542.144, Total count    =        14805]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  22119 requests in 30.16s, 7.98MB read
  Non-2xx or 3xx responses: 1512
Requests/sec:    733.46
Transfer/sec:    271.06KB
------------------------------
X-Cache  HIT=19848  MISS=759  BYPASS=0  writes=0  http_errors=1512
Cache hit ratio: 96.32%
Socket errors: connect=0 read=0 write=0 timeout=0
p50       94.14 ms
p90      100.73 ms
p99      130.30 ms
p99.9    189.18 ms